Reports/ИА_СостояниеСтатистикКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ИА_СостояниеСтатистикКомпании</Name>
		</Properties>
	</Report>
</MetaDataObject>

Enums/ИА_ПериодыДетализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ПериодыДетализации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипТерминалаОргСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипТерминалаОргСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учредитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководящийСостав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Департамент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Секция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сектор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_НастройкиРабочегоСтолаСтатистик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_НастройкиРабочегоСтолаСтатистик</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнойПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ПериодыДетализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВСтроке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалить_ОтображатьТолькоЗавершенныеПериоды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерШрифта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПериодДетализации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ПериодыДетализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Статистики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСтатистики</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДетализации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ПериодыДетализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокДиаграммы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветГрафика</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ЦветаГрафика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеДляЛегенды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказыватьВИЦО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИА_ПериодКвоты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ПериодыДетализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИА_НеОтображатьНаРабочемСтоле</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИА_ТипКвоты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ТипыКвот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветГрафикаНарастающейКвоты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ЦветаГрафика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветГрафикаХран</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветГрафикаНарастающейКвотыХран</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УзорТочки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_УзорыТочекСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаштабМинимум</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаштабМаксимум</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СдвигПериода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСдвигаПериода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ПериодыДетализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ИА_СостояниеСтатистикКомпании/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	Если ПериодДетализации = Перечисления.ИА_ПериодыДетализации.День Тогда
		ДатаНачала = ДатаКонца - 60*60*24;
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Неделя Тогда
		ДатаНачала = ДатаКонца - 60*60*24 * 13;
	ИначеЕсли ПериодДетализации = Перечисления.ИА_ПериодыДетализации.Месяц Тогда
		ДатаНачала = ДобавитьМесяц(НачалоМесяца(ДатаКонца), -1);
	КонецЕсли;
	
	Данные = Новый ТаблицаЗначений;
	кч = Новый КвалификаторыЧисла(15,2);
	Данные.Колонки.Добавить("ДатаНачала", новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("ДатаКонца", новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("Значение", новый ОписаниеТипов("Число",кч));
	Данные.Колонки.Добавить("ЕстьЗначение", новый ОписаниеТипов("Булево"));
	Данные.Колонки.Добавить("РеальныеДанные", новый ОписаниеТипов("Булево"));
	Данные.Колонки.Добавить("Квота", новый ОписаниеТипов("Число",кч));
	Данные.Колонки.Добавить("ДанныеВведены", новый ОписаниеТипов("Булево"));

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика1,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика2,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Аналитика3,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ЗаголовокДиаграммы,
	               |	ОргСхема.Ссылка КАК Пост,
	               |	&ПериодДетализации КАК ПериодДетализации,
	               |	0 КАК СдвигПериода,
	               |	0 КАК НомерТекущейДаты,
	               |	ОргСхемаСотрудники.ФизЛицо КАК Сотрудник,
	               |	12345 КАК Уровень,
	               |	ЛОЖЬ КАК Рост,
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.ВидСтатистики.ПеревернутаяСтатистика КАК ПеревернутаяСтатистика
	               |ИЗ
	               |	Справочник.ИА_НастройкиРабочегоСтолаСтатистик.Статистики КАК ИА_НастройкиРабочегоСтолаСтатистикСтатистики
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОргСхема КАК ОргСхема
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОргСхема.Сотрудники КАК ОргСхемаСотрудники
	               |			ПО ОргСхема.Ссылка = ОргСхемаСотрудники.Ссылка
	               |				И (ОргСхемаСотрудники.НомерСтроки = 1)
	               |		ПО ИА_НастройкиРабочегоСтолаСтатистикСтатистики.Ссылка = ОргСхема.НастройкаСтатистик
	               |ГДЕ
	               |	ИА_НастройкиРабочегоСтолаСтатистикСтатистики.НомерСтроки = 1
	               |	И ОргСхема.ПометкаУдаления = ЛОЖЬ
	               |	И ОргСхема.Ссылка В ИЕРАРХИИ(&Организация)
	               |	И (ОргСхема.ТипТерминала = &ТипТерминала
	               |			ИЛИ &ТипТерминала = ЗНАЧЕНИЕ(Перечисление.ТипТерминалаОргСхемы.ПустаяСсылка))";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТипТерминала", ОтборТипТерминала);
	Запрос.УстановитьПараметр("ПериодДетализации", ПериодДетализации);
	
	РезДер = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	РезДер.Колонки.Добавить("Данные");
	
	Для каждого стр из РезДер.Строки Цикл
		стр.Данные = Данные.Скопировать(); 
		стр.Уровень = стр.Пост.Уровень();
	КонецЦикла;

	
	ЭмулОбъект = Новый Структура("ДатаНачала,ДатаКонца,Настройка", ДатаНачала, ДатаКонца,Справочники.ИА_НастройкиРабочегоСтолаСтатистик.ПустаяСсылка());
	
	Выходные = ИА_Защита_Статистика.ПолучитьВыходныеЗаПериод(ДатаНачала, ДатаКонца);
	ИА_Статистики.ПолучитьТочки(ЭмулОбъект,Выходные,РезДер);
	
	
	рез.Очистить();
	Для каждого стр из РезДер.Строки Цикл
		Новстр = Рез.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
		Новстр.ПредЗн = стр.данные[0].Значение;
		Новстр.ТекЗн = стр.данные[1].Значение;
		
		Если (Новстр.ТекЗн>Новстр.ПредЗн и не стр.ПеревернутаяСтатистика) или (Новстр.ТекЗн<Новстр.ПредЗн и стр.ПеревернутаяСтатистика) Тогда
			Новстр.Рост = истина;
		КонецЕсли;
	КонецЦикла;
	
	рез.Сортировать("Рост УБЫВ,Уровень");
	//
	ТабДок.Очистить();
	обОтчет = РеквизитФормыВЗначение("Отчет");
	Макет = обОтчет.ПолучитьМакет("Макет");
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ЗаполнитьЗначенияСвойств(ОблШапка.параметры, ЭтаФорма);
	ТабДок.Вывести(ОблШапка);
	
	НСтроки = рез.НайтиСтроки(Новый Структура("Рост", Истина));
	
	МассСотр = Новый Массив;
	Для каждого стр из НСтроки Цикл
		Если ЗначениеЗаполнено(Стр.Сотрудник) и МассСотр.Найти(Стр.Сотрудник) = Неопределено Тогда
			МассСотр.Добавить(Стр.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	ОблСтрока = Макет.ПолучитьОбласть("Строка1");
	ОблСтрока.параметры.Пост = "Растущие статистики (" + НСтроки.Количество() + "):";
	ОблСтрока.параметры.Сотрудник = "(" + МассСотр.Количество() + ")";
	ОблСтрока.Область("R1C2:R1C2").расшифровка =МассСотр; 
	ТабДок.Вывести(ОблСтрока);
		
	Для каждого стр из НСтроки Цикл
		ОблСтрока = Макет.ПолучитьОбласть("Строка");
		ЗаполнитьЗначенияСвойств(ОблСтрока.параметры, стр);
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
	
	//
	
	НСтроки = рез.НайтиСтроки(Новый Структура("Рост", ложь));
	
	МассСотр = Новый Массив;
	Для каждого стр из НСтроки Цикл
		Если ЗначениеЗаполнено(Стр.Сотрудник) и МассСотр.Найти(Стр.Сотрудник) = Неопределено Тогда
			МассСотр.Добавить(Стр.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	ОблСтрока = Макет.ПолучитьОбласть("Строка1");
	ОблСтрока.параметры.Пост = "Падающие статистики (" + НСтроки.Количество() + "):";
	ОблСтрока.параметры.Сотрудник = "(" + МассСотр.Количество() + ")";
	ОблСтрока.Область("R1C2:R1C2").расшифровка =МассСотр; 
	ТабДок.Вывести(ОблСтрока);
		
	Для каждого стр из НСтроки Цикл
		ОблСтрока = Макет.ПолучитьОбласть("Строка");
		ЗаполнитьЗначенияСвойств(ОблСтрока.параметры, стр);
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ДатаКонца = Дата(1,1,1) или ПериодДетализации.Пустая() Тогда
		ПоказатьПредупреждение(,"Укажите конец периода отчета и анализируемый период!");
		возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры
